blogs/tcpdump-tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-20 四 19:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>tcpdump 指南</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">tcpdump 指南</h1>
<p>
译自 <a href="https://danielmiessler.com/study/tcpdump/">A tcpdump Tutorial and Primer with Examples</a> 有所增删，可以通过 <code>man tcpdump</code> 获取更详细信息
</p>

<p>
只要和网络沾边，都可以使用tcpdump来排查问题。
</p>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> 基础</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 常用选项</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><code>-i any</code> ：监听任意网络设备</li>
<li><code>-i eth0</code> ：监听eth0</li>
<li><code>-D</code> ：列出所有可监听设备</li>
<li><code>-n</code> ：不要把IP解析为主机名（显示IP）</li>
<li><code>-nn</code> ：不要把IP和PORT解析为主机名和服务（显示IP和端口）</li>
<li><code>-q</code> ：显示更少信息</li>
<li><code>-tttt</code> ：更具有可读性的时间格式</li>
<li><code>-X</code> ：以hex和ascii格式显示包内容</li>
<li><code>-XX</code> ：同 <code>-X</code> , 同时包含以太网协议头</li>
<li><code>-v, -vv, -vvv</code> ：显示更多信息</li>
<li><code>-c x</code> ：最多抓取x个包，然后退出</li>
<li><code>-A</code> ：以ASCII格式打印每个包（最小化link level的头）,适合抓web页面</li>
<li><code>-s</code> ：Define the snaplength (size) of the capture in bytes. 使用 <code>-s0</code> 获取全部</li>
<li><code>-w file</code> ：把结果输出到文件file</li>
<li><code>-S</code> ：Print absolute sequence numbers.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 表达式</h3>
<div class="outline-text-3" id="text-1-2">
<p>
表达式用于过滤抓到的包，有三类表达式
</p>
<ul class="org-ul">
<li>类型 <code>host</code> <code>net</code> <code>port</code></li>
<li>数据流向 <code>src</code> <code>dst</code></li>
<li>协议 <code>tcp</code> <code>udp</code> <code>icmp</code> 等</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">2</span> 例子</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> 获取所有流量</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>tcpdump -i any</code> 当机器有多个网卡，不确定流量走哪个时，使用这个选项
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> 获取eth0上的流量</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>tcpdump -i eth0</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.3</span> 查看原始流量</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>tcpdump -nn -tttt -vv -S -c 10</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.4</span> 查看指定host和port</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>tcpdump port 80 and host 10.129.204.105</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.5</span> 以hex和ascii查看包内容</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>tcpdump -nn -v -X -s0 -c 1 tcp</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.6</span> 指定数据的方向</h3>
<div class="outline-text-3" id="text-2-6">
<p>
获取所有目标端口是80的流量
<code>tcpdump -i any -nn -s0 -c 10 -A tcp and dst port 80</code>
</p>

<p>
获取所有80端口的流量
<code>tcpdump -i any -nn -s0 -c 10 -A tcp and port 80</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.7</span> 获取指定协议的流量</h3>
<div class="outline-text-3" id="text-2-7">
<p>
获取vrrp协议的流量，用于调试keepalive
<code>tcpdump vrrp</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.8</span> 获取ipv6的流量</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<code>tcpdump ip6</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.9</span> 获取某个端口范围的流量</h3>
<div class="outline-text-3" id="text-2-9">
<p>
<code>tcpdump -nn portrange 21-23 and src host 10.136.110.179</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.10</span> 基于包大小过滤</h3>
<div class="outline-text-3" id="text-2-10">
<p>
<code>tcpdump -i any -nn port 80 and less 80</code>
</p>

<p>
<code>tcpdump -i any -nn port 80 and greater 80</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">3</span> 进阶</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.1</span> 表达式组合</h3>
<div class="outline-text-3" id="text-3-1">
<p>
通过 <code>and 或 &amp;&amp;</code> <code>or 或 ||</code> <code>not 或 ！</code> 可以组合表达式
</p>

<p>
表达式的结合律有点奇怪，需要自己体会，例如：
监听80或8080并且来自10.129.204.105的请求
<code>tcpdump -i any -nn -vv port 80 or 8080 and src host 10.129.204.105</code>
<code>tcpdump -i any -nn -vv port 80 or port 8080 and src host 10.129.204.105</code>
</p>

<p>
监听80并且来自10.129.204.105的请求或监听8080的请求（没有来源IP限制）
<code>tcpdump -i any -nn -vv port 80 and src host 10.129.204.105 or port 8080</code>
</p>

<p>
为了避免这些微妙的差别，可以使用 <code>()</code> ，注意这里的单引号
<code>tcpdump -i any -nn -vv '(port 80 or port 8080)' and src host 10.129.204.105</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.2</span> 指定源host和目标端口</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>tcpdump -i any -nn -vv port 80 and src host 10.129.204.105</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.3</span> 目标是某台机器的所有非tcp请求</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>tcpdump -i any -nn dst host 10.136.110.179 and not tcp</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.4</span> 来自某台机器的所有非22请求</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>tcpdump -i any -nn src host 10.129.204.105 and not dst port 22</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">3.5</span> 获取tcp flag</h3>
<div class="outline-text-3" id="text-3-5">
<p>
先了解下TCP和IP协议头，虽然最后有0~40个可选bytes，这里没用到，可以先忽略它们。TCP头20bytes，其中tcp flags在第13个byte（下标为0） <code>|C|E|U|A|P|R|S|F|</code> 。
</p>

<div class="org-src-container">

<pre class="src src-ditta">TCP
 0                            15                              31
-----------------------------------------------------------------
|          source port          |       destination port        |
-----------------------------------------------------------------
|                        sequence number                        |
-----------------------------------------------------------------
|                     acknowledgment number                     |
-----------------------------------------------------------------
|  HL   | rsvd  |C|E|U|A|P|R|S|F|        window size            |
-----------------------------------------------------------------
|         TCP checksum          |       urgent pointer          |
-----------------------------------------------------------------
|                 optional data 0~40 bytes                      |
-----------------------------------------------------------------

 |---------------|
 |C|E|U|A|P|R|S|F|
 |---------------|
 |7   5   3     0|

IP
  0| 1| 2| 3| 4| 5| 6| 7| 8| 9|10|11|12|13|14|15|16|17|18|19|20|21|22|23|24|25|26|27|28|29|30|31
------------------------------------------------------------------------------------------------
| version   |    IHL    |      DSCP       | ECN |             total length                     |
------------------------------------------------------------------------------------------------
|             Identification                    | Flags  |       Fragment Offset               |
------------------------------------------------------------------------------------------------
|          TTL          |      Protocol         |               Header Checksum                |
------------------------------------------------------------------------------------------------
|                                         Source IP                                            |
------------------------------------------------------------------------------------------------
|                                        Destination IP                                        |
------------------------------------------------------------------------------------------------
</pre>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">3.5.1</span> flag列表</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>URGENT (URG) <code>tcp[13] &amp; 32 != 0</code> 或 <code>tcp[tcpflags] == tcp-urg</code></li>
<li>ACKNOWLEDGE (ACK) <code>tcp[13] &amp; 16 != 0</code> 或 <code>tcp[tcpflags] == tcp-ack</code></li>
<li>PUSH (PSH) <code>tcp[13] &amp; 8 != 0</code> 或 <code>tcp[tcpflags] == tcp-psh</code></li>
<li>RESET (RST) <code>tcp[13] &amp; 4 != 0</code> 或 <code>tcp[tcpflags] == tcp-rst</code></li>
<li>SYNCHRONIZE (SYN) <code>tcp[13] &amp; 2 != 0</code> 或 <code>tcp[tcpflags] == tcp-syn</code></li>
<li>FINISH (FIN) <code>tcp[13] &amp; 1 != 0</code> 或 <code>tcp[tcpflags] == tcp-fin</code></li>
</ul>

<p>
例如：获取所有SYN请求 <code>tcpdump -i any -nn -A -s0 'tcp[13] &amp; 2 != 0'</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">3.5.2</span> 获取tcp连接的开始和结束</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
<code>tcpdump -i any -nn -s0 -X 'tcp[tcpflags] &amp; (tcp-syn|tcp-fin) != 0'</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">3.5.3</span> 获取所有HTTP GET请求</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
<code>tcp[12]</code> 的高4位是TCP HEADER的长度（通常是20 bytes）,TCP之后是应用协议 <code>0x47455420</code> 是 GET 外加一个空格
<code>tcpdump -i any -nn -s0 -X 'tcp[((tcp[12] &amp; 0xf0) &gt;&gt; 2):4] = 0x47455420'</code>
通常 <code>tcpdump -i any -nn -s0 -X 'tcp[20:4] = 0x47455420'</code> 也是可以的
</p>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.5.4</span> 获取所有SSH连接</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
<code>0x5353482D</code> 是 <code>SSH-</code>
<code>tcpdump -i any -nn -s0 -X 'tcp[20:4] = 0x5353482D'</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">3.5.5</span> 获取所有带数据的包</h4>
<div class="outline-text-4" id="text-3-5-5">
<p>
<code>ip[2:2]</code> 整个IP包的长度 <code>(ip[0] &amp; 0xf) &lt;&lt;2</code> 是IP头的长度
<code>tcpdump -i any -nn -s0 -X port 80 and '(((ip[2:2] - ((ip[0]&amp;0xf)&lt;&lt;2)) - ((tcp[12]&amp;0xf0)&gt;&gt;2)) != 0)'</code>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-07-20 四 19:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
